
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 6 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_route.azure_firewall_routes[&#34;10.63.111.175/32&#34;]
  * azurerm_route.azure_firewall_routes[&#34;10.63.111.176/32&#34;]
  * azurerm_route.azure_firewall_routes[&#34;10.63.111.187/32&#34;]
  * azurerm_route.azure_firewall_routes[&#34;10.63.111.188/32&#34;]
  * azurerm_route.azure_firewall_routes[&#34;10.65.64.155/32&#34;]
  * azurerm_route.azure_firewall_routes[&#34;10.65.64.156/32&#34;]
  * azurerm_route.azure_firewall_routes[&#34;10.65.64.180/32&#34;]
  * azurerm_route.azure_firewall_routes[&#34;10.65.64.181/32&#34;]
* Update
  * azurerm_firewall_policy.migration_policy
  * azurerm_firewall_policy_rule_collection_group.migration_policy_rules
  * azurerm_managed_disk.migration_data
  * module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.darts_migration_key_vault.azurerm_key_vault.kv
  * module.darts_migration_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;b31f6666-e2e4-4a0b-9399-b64446b1e412&#34;]
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.product_team_access_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_firewall_policy.migration_policy will be updated in-place
  ~ resource "azurerm_firewall_policy" "migration_policy" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/firewallPolicies/darts-migration-policy-stg"
        name                              = "darts-migration-policy-stg"
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (9 unchanged attributes hidden)

      ~ insights {
          - retention_in_days                  = 30 -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_firewall_policy_rule_collection_group.migration_policy_rules will be updated in-place
  ~ resource "azurerm_firewall_policy_rule_collection_group" "migration_policy_rules" {
        id                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/firewallPolicies/darts-migration-policy-stg/ruleCollectionGroups/darts-migration-fwpolicyrules-stg"
        name               = "darts-migration-fwpolicyrules-stg"
        # (2 unchanged attributes hidden)

      + nat_rule_collection {
          + action   = "Dnat"
          + name     = "darts-migration-prod"
          + priority = 100

          + rule {
              + destination_address = "10.24.239.196"
              + destination_ports   = [
                  + "3218",
                ]
              + name                = "CN0052-Node1-A-DNAT"
              + protocols           = [
                  + "TCP",
                  + "UDP",
                ]
              + source_addresses    = [
                  + "10.63.111.175",
                ]
              + source_ip_groups    = []
              + translated_address  = "10.23.253.241"
              + translated_port     = 3218
            }
          + rule {
              + destination_address = "10.24.239.196"
              + destination_ports   = [
                  + "3682",
                ]
              + name                = "CN0052-Node1-B-DNAT"
              + protocols           = [
                  + "TCP",
                  + "UDP",
                ]
              + source_addresses    = [
                  + "10.63.111.187",
                ]
              + source_ip_groups    = []
              + translated_address  = "10.23.253.241"
              + translated_port     = 3682
            }
          + rule {
              + destination_address = "10.24.239.196"
              + destination_ports   = [
                  + "3218",
                ]
              + name                = "CN0052-Node2-A-DNAT"
              + protocols           = [
                  + "TCP",
                  + "UDP",
                ]
              + source_addresses    = [
                  + "10.63.111.176",
                ]
              + source_ip_groups    = []
              + translated_address  = "10.23.253.242"
              + translated_port     = 3218
            }
          + rule {
              + destination_address = "10.24.239.196"
              + destination_ports   = [
                  + "3682",
                ]
              + name                = "CN0052-Node2-B-DNAT"
              + protocols           = [
                  + "TCP",
                  + "UDP",
                ]
              + source_addresses    = [
                  + "10.63.111.188",
                ]
              + source_ip_groups    = []
              + translated_address  = "10.23.253.242"
              + translated_port     = 3682
            }
          + rule {
              + destination_address = "10.24.239.196"
              + destination_ports   = [
                  + "3682",
                ]
              + name                = "CN0052-Node3-A-DNAT"
              + protocols           = [
                  + "TCP",
                  + "UDP",
                ]
              + source_addresses    = [
                  + "10.65.64.155",
                ]
              + source_ip_groups    = []
              + translated_address  = "10.23.253.243"
              + translated_port     = 3218
            }
          + rule {
              + destination_address = "10.24.239.196"
              + destination_ports   = [
                  + "3682",
                ]
              + name                = "CN0052-Node3-B-DNAT"
              + protocols           = [
                  + "TCP",
                  + "UDP",
                ]
              + source_addresses    = [
                  + "10.65.64.180",
                ]
              + source_ip_groups    = []
              + translated_address  = "10.23.253.243"
              + translated_port     = 3682
            }
          + rule {
              + destination_address = "10.24.239.196"
              + destination_ports   = [
                  + "3682",
                ]
              + name                = "CN0052-Node4-A-DNAT"
              + protocols           = [
                  + "TCP",
                  + "UDP",
                ]
              + source_addresses    = [
                  + "10.65.64.156",
                ]
              + source_ip_groups    = []
              + translated_address  = "10.23.253.244"
              + translated_port     = 3218
            }
          + rule {
              + destination_address = "10.24.239.196"
              + destination_ports   = [
                  + "3682",
                ]
              + name                = "CN0052-Node4-B-DNAT"
              + protocols           = [
                  + "TCP",
                  + "UDP",
                ]
              + source_addresses    = [
                  + "10.65.64.181",
                ]
              + source_ip_groups    = []
              + translated_address  = "10.23.253.244"
              + translated_port     = 3682
            }
        }

      ~ network_rule_collection {
            name     = "darts-migration-stg"
          ~ priority = 100 -> 300
            # (1 unchanged attribute hidden)

            # (4 unchanged blocks hidden)
        }
    }

  # azurerm_managed_disk.migration_data will be updated in-place
  ~ resource "azurerm_managed_disk" "migration_data" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/disks/migration-datadisk"
        name                          = "migration-datadisk"
      ~ storage_account_type          = "Premium_LRS" -> "Standard_LRS"
        tags                          = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_route.azure_firewall_routes["10.63.111.175/32"] will be created
  + resource "azurerm_route" "azure_firewall_routes" {
      + address_prefix         = "10.63.111.175/32"
      + id                     = (known after apply)
      + name                   = "azure_firewall_routes_10_63_111_175"
      + next_hop_in_ip_address = "10.24.239.196"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "darts-migration-stg-rg"
      + route_table_name       = "darts-migration-rt-stg"
    }

  # azurerm_route.azure_firewall_routes["10.63.111.176/32"] will be created
  + resource "azurerm_route" "azure_firewall_routes" {
      + address_prefix         = "10.63.111.176/32"
      + id                     = (known after apply)
      + name                   = "azure_firewall_routes_10_63_111_176"
      + next_hop_in_ip_address = "10.24.239.196"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "darts-migration-stg-rg"
      + route_table_name       = "darts-migration-rt-stg"
    }

  # azurerm_route.azure_firewall_routes["10.63.111.187/32"] will be created
  + resource "azurerm_route" "azure_firewall_routes" {
      + address_prefix         = "10.63.111.187/32"
      + id                     = (known after apply)
      + name                   = "azure_firewall_routes_10_63_111_187"
      + next_hop_in_ip_address = "10.24.239.196"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "darts-migration-stg-rg"
      + route_table_name       = "darts-migration-rt-stg"
    }

  # azurerm_route.azure_firewall_routes["10.63.111.188/32"] will be created
  + resource "azurerm_route" "azure_firewall_routes" {
      + address_prefix         = "10.63.111.188/32"
      + id                     = (known after apply)
      + name                   = "azure_firewall_routes_10_63_111_188"
      + next_hop_in_ip_address = "10.24.239.196"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "darts-migration-stg-rg"
      + route_table_name       = "darts-migration-rt-stg"
    }

  # azurerm_route.azure_firewall_routes["10.65.64.155/32"] will be created
  + resource "azurerm_route" "azure_firewall_routes" {
      + address_prefix         = "10.65.64.155/32"
      + id                     = (known after apply)
      + name                   = "azure_firewall_routes_10_65_64_155"
      + next_hop_in_ip_address = "10.24.239.196"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "darts-migration-stg-rg"
      + route_table_name       = "darts-migration-rt-stg"
    }

  # azurerm_route.azure_firewall_routes["10.65.64.156/32"] will be created
  + resource "azurerm_route" "azure_firewall_routes" {
      + address_prefix         = "10.65.64.156/32"
      + id                     = (known after apply)
      + name                   = "azure_firewall_routes_10_65_64_156"
      + next_hop_in_ip_address = "10.24.239.196"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "darts-migration-stg-rg"
      + route_table_name       = "darts-migration-rt-stg"
    }

  # azurerm_route.azure_firewall_routes["10.65.64.180/32"] will be created
  + resource "azurerm_route" "azure_firewall_routes" {
      + address_prefix         = "10.65.64.180/32"
      + id                     = (known after apply)
      + name                   = "azure_firewall_routes_10_65_64_180"
      + next_hop_in_ip_address = "10.24.239.196"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "darts-migration-stg-rg"
      + route_table_name       = "darts-migration-rt-stg"
    }

  # azurerm_route.azure_firewall_routes["10.65.64.181/32"] will be created
  + resource "azurerm_route" "azure_firewall_routes" {
      + address_prefix         = "10.65.64.181/32"
      + id                     = (known after apply)
      + name                   = "azure_firewall_routes_10_65_64_181"
      + next_hop_in_ip_address = "10.24.239.196"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "darts-migration-stg-rg"
      + route_table_name       = "darts-migration-rt-stg"
    }

  # module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg|darts-stg"
        name                           = "darts-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.darts_migration_key_vault.data.azuread_group.developers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "developers" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS CFT Developers"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = (known after apply)
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.darts_migration_key_vault.data.azuread_group.product_team[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "product_team" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Darts Modernisation"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.darts_migration_key_vault.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.darts_migration_key_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg"
        name                            = "darts-migration-stg"
        tags                            = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
      ~ tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.developer[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "developer" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> (known after apply)
      ~ object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" # forces replacement -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy["b31f6666-e2e4-4a0b-9399-b64446b1e412"] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/b31f6666-e2e4-4a0b-9399-b64446b1e412" -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/87c8cf3d-ff9d-4d8f-8430-ccc737764435" -> (known after apply)
      ~ object_id               = "87c8cf3d-ff9d-4d8f-8430-ccc737764435" # forces replacement -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg|darts-migration-stg"
        name                           = "darts-migration-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 12 to add, 6 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":103,"Program":"tfcmt","SHA1":"","Vars":{}} -->